-- Добавяне на нова песен:
exec PRO_INS('Test Song', 10.00, 10, 2023, 1, 2, 3, 1);

-- Добавяне на нова продажба:
exec SAL_INS(to_date('20-NOV-23','DD-MON-RR'),1,1);

-- Добавяне на продукти към поръчката:
exec SAL_PRO_INS(15, 46, 16);

-- Обновяване на наличното количество:
exec PRO_UPD(16, 'Updated Test Song', 10.00, 20, 2023, 1, 2, 3, 1);

-- Връщане на поръчката
exec RETURN_SALE(46);


-- Справка за брой продажби на служител, подредени по дата:
exec find_employee_sales('Lilyan', 'Dobrev');

-- Справка за последните 5 продажби на стоки, подредени по служител:
exec find_latest_sales();

-- Справка за закупени стоки от клиент, подредени по вид и дата:
exec find_client_products('Bozhidar', 'Vitanov');

-- Справка, извeждаща всички закупени продукти в дадена продажба, подредени по дата:
exec find_sale_products(1);